In [1]:
import pandas as pd

In [8]:
data = {'Prod' : ['Tumbler', 'fountain_pen', 'lunch-box', 'cup'], 'Price' : [12000, 20, 400, 70], 'Quantity' : [2, 10, 5, 12]}

In [9]:
df = pd.DataFrame(data)
df

           Prod  Price  Quantity
0       Tumbler  12000         2
1  fountain_pen     20        10
2     lunch-box    400         5
3           cup     70        12

In [5]:
df['Revenue'] = df.apply( lambda x: x['Price'] * x['Quantity'], axis=1)

In [6]:
df

        Prod  Price  Quantity  Revenue
0    Tumbler  12000         2    24000
1        pen     20        10      200
2  lunch-box    400         5     2000
3        cup     70        12      840

In [7]:
df.assign(Revenue_new = df['Price'] * df['Quantity'])

        Prod  Price  Quantity  Revenue  Revenue_new
0    Tumbler  12000         2    24000        24000
1        pen     20        10      200          200
2  lunch-box    400         5     2000         2000
3        cup     70        12      840          840

In [12]:
df['short_names'] = df['Prod'].map(lambda x:x[0:3])

In [13]:
df

           Prod  Price  Quantity short_names
0       Tumbler  12000         2         Tum
1  fountain_pen     20        10         fou
2     lunch-box    400         5         lun
3           cup     70        12         cup

In [20]:
df['Prod'][0][0:3]

'Tum'